In [1]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import MinMaxScaler

Normalize Datasets

In [2]:
# define data
data = np.array([[100,0.001],[8,0.05],[50,0.005],[88,0.07],[4,0.1]])
pd.DataFrame(data)

       0      1
0  100.0  0.001
1    8.0  0.050
2   50.0  0.005
3   88.0  0.070
4    4.0  0.100

In [3]:
# define min max scalar
scaler = MinMaxScaler()

# transform data
scaled = scaler.fit_transform(data)

In [4]:
pd.DataFrame(scaled)

          0         1
0  1.000000  0.000000
1  0.041667  0.494949
2  0.479167  0.040404
3  0.875000  0.696970
4  0.000000  1.000000

Standardizing a DataSets

In [5]:
from sklearn.preprocessing import StandardScaler

In [6]:
scaler = StandardScaler()
# transform data
scaled = scaler.fit_transform(data)

In [7]:
pd.DataFrame(scaled)

          0         1
0  1.263981 -1.163900
1 -1.061744  0.126396
2  0.000000 -1.058569
3  0.960626  0.653048
4 -1.162863  1.443025

Dummy Variables

In [27]:
import pandas as pd
df = pd.DataFrame(['Chicago','Boston','Seattle'],columns=['City'])
df

      City
0  Chicago
1   Boston
2  Seattle

In [28]:
pd.get_dummies(df.City)

   Boston  Chicago  Seattle
0       0        1        0
1       1        0        0
2       0        0        1

In [29]:
pd.get_dummies(df.City,prefix='City')

   City_Boston  City_Chicago  City_Seattle
0            0             1             0
1            1             0             0
2            0             0             1

In [30]:
df = df.join(pd.get_dummies(df.City))

In [31]:
df

      City  Boston  Chicago  Seattle
0  Chicago       0        1        0
1   Boston       1        0        0
2  Seattle       0        0        1